## DataFrames

### Process Data with
- Columns
- Filters
- Mapping

In [1]:
import pandas as pd
# Read the new csv file output3.csv
df = pd.read_csv('output3.csv')
display(df)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    Denny   54      Chicago  110000
4     Elly   18  Los Angeles   36000
5    Frank   70  Los Angeles   30000

In [30]:
# get specified rows
df[2:5]

      Name  Age         City  Salary
2  Charlie   35      Chicago   90000
3    Denny   54      Chicago  110000
4     Elly   18  Los Angeles   36000

In [31]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      Denny
4       Elly
5      Frank
Name: Name, dtype: object

In [17]:
df[ ['Name', 'City'] ]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    Denny        Tokyo
4     Elly       Taipei
5    Frank        Paris

In [13]:
# Filter by single condition
df[ df['Age'] > 30 ]

      Name  Age     City  Salary
2  Charlie   35  Chicago   90000
3    Denny   54    Tokyo  110000
5    Frank   70    Paris   30000

In [14]:
# Filter by multiple conditions
df[
    (df['Age'] > 30) & 
    (df['Salary'] > 50000)
]

      Name  Age     City  Salary
2  Charlie   35  Chicago   90000
3    Denny   54    Tokyo  110000

In [ ]:
# Filter by multiple conditions and select specific columns
df[
    (df['Age'] > 30) & 
    (df['Salary'] > 50000)
][['Name', 'City']]

      Name     City
2  Charlie  Chicago
3    Denny    Tokyo

In [ ]:
# Get unique values in a column
pd.unique(df['City'])

array(['New York', 'Los Angeles', 'Chicago'], dtype=object)

In [34]:
# Add a new column
df['Pets'] = [1, 0, 2, 2, 0, 3]
display(df)

      Name  Age         City  Salary  Pets
0    Alice   25     New York   70000     1
1      Bob   30  Los Angeles   80000     0
2  Charlie   35      Chicago   90000     2
3    Denny   54      Chicago  110000     2
4     Elly   18  Los Angeles   36000     0
5    Frank   70  Los Angeles   30000     3

In [36]:
# Add new colume by mapping
# Create a dictionary of people with license
DriveLicense = {
    'Frank': False,
    'Denny': True,
    'Alice': False,
    'Elly': False
}

# Add the 'Drive License' column by mapping the 'Name' column
df['Drive License'] = df['Name'].map(DriveLicense)
display(df)

      Name  Age         City  Salary  Pets Drive License
0    Alice   25     New York   70000     1         False
1      Bob   30  Los Angeles   80000     0           NaN
2  Charlie   35      Chicago   90000     2           NaN
3    Denny   54      Chicago  110000     2          True
4     Elly   18  Los Angeles   36000     0         False
5    Frank   70  Los Angeles   30000     3         False